# Boolean Indexing
- Seires / Dataframe 객체에서 빠르게 원하는 원소를 추출하기 위해 사용
- Series / Dataframe 객체의 원소에 연산 후 True/False인 결과 반환

In [39]:
# 모듈 로딩
import pandas as pd

# df 객체 생성
df = pd.DataFrame({'name':['Park','Kim','Lee'],
                   'age':[25,35,17],
                   'gender':['F','M','M']})
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
 2   gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [40]:
# df 객체데이터 확인
df

   name  age gender
0  Park   25      F
1   Kim   35      M
2   Lee   17      M

In [41]:
# age column + 비교연산 -> 20세 이상인지?
ageCol = df['age']
result = ageCol >= 20
result

0     True
1     True
2    False
Name: age, dtype: bool

In [42]:
# age가 20세 이상인 data만 추출
df[result]

   name  age gender
0  Park   25      F
1   Kim   35      M

In [57]:
df

   name  age gender
0  Park   25      F
1   Kim   35      M
2   Lee   17      M

# 과제 - 0701

In [72]:
# 20세 이상 남자만 추출하기
result = (df['age'] >= 20) & (df['gender'] == 'M')    # 왜 and 로 쓰면 안되는지? True, False 비교하는건데 왜?
df[result]

  name  age gender
1  Kim   35      M

# 산술, 논리, 비교, 비트 연산자 공부해보기..